Dishoungh/MSP432_Game_System/game.c
/*
 * game.c
 *
 *  Created on: Dec 7, 2017
 *      Author: alex
 *
 *  Modified by: Dishoungh
 */
#include "msp.h"
#include "game.h"
#include "msp_boosterpack_lcd/lcd.h"

const GAME game_array[5] = {DEBUG,PONG,DODGE,PATTERN,SNAKE};

void initialize_buttons(void){
    button_flag = 0;

    //upper button setup
    P5->SEL0 &= ~BIT1;
    P5->SEL0 &= ~BIT1;
    P5->DIR &= ~BIT1;
    P5->REN |= BIT1;
    P5->OUT |= BIT1;            //pullup resistor activated
    P5->IFG &= ~BIT1;
    P5->IES |= BIT1;            //falling edge trigger
    P5->IE |= BIT1;             //interrupts enabled
    NVIC_EnableIRQ(PORT5_IRQn);

    //lower button setup
    P3->SEL0 &= ~BIT3;
    P3->SEL0 &= ~BIT3;
    P3->DIR &= ~BIT3;
    P3->REN |= BIT3;
    P3->OUT |= BIT3;            //pullup resistor activated
    P3->IFG &= ~BIT3;
    P3->IES |= BIT3;            //falling edge trigger
    P3->IE |= BIT3;             //interrupts enabled
    NVIC_EnableIRQ(PORT3_IRQn);
}
/*draws start screen*/
void draw_start_screen(void){
    LCD_erase_screen();

    initialize_rectangle(&start_screen, START_SCREEN_X, START_SCREEN_Y, START_SCREEN_WIDTH, START_SCREEN_HEIGHT, BLACK);
    LCD_write_string("PRESS BUTTON", start_screen.x, start_screen.y + LCD_CHAR_HEIGHT, BLACK, 12);
    LCD_write_string("  TO START  ", start_screen.x, start_screen.y, BLACK, 12);
    while(!button_flag);
    start_screen.x -= LCD_CHAR_WIDTH;
    LCD_erase_rectangle(start_screen);
    start_screen.x += LCD_CHAR_WIDTH;
    button_flag = 0;
}

//allows the user to select what game they want to play
void select_game(void){
    LCD_erase_screen();

    current_game = 4;

    RECT game_menu;
    initialize_rectangle(&game_menu,GAME_MENU_X,GAME_MENU_Y,GAME_MENU_WIDTH,GAME_MENU_HEIGHT,BLACK);

    RECT game_select;
    initialize_rectangle(&game_select,GAME_SELECT_X,GAME_SELECT_Y,GAME_SELECT_WIDTH,GAME_SELECT_HEIGHT,RED);
    LCD_draw_rectangle(game_select);

    LCD_write_string("CHOOSE GAME",game_menu.x,game_menu.y + 5*LCD_CHAR_HEIGHT,RED,11);
    LCD_write_string(" DEBUG     ",game_menu.x,game_menu.y + 4*LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" PONG      ",game_menu.x,game_menu.y + 3*LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" DODGE     ",game_menu.x,game_menu.y + 2*LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" PATTERN   ",game_menu.x,game_menu.y + 1*LCD_CHAR_HEIGHT,BLACK,11);
    LCD_write_string(" SNAKE     ",game_menu.x,game_menu.y + 0*LCD_CHAR_HEIGHT,BLACK,11);


    while(!button_flag){
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if(timer_trigger && !timer_delay){
            //if joystick is moved up and the selection is not already at the top, move selection
            if((bit_joy_y > JOY_HIGH_THRESHOLD) && (current_game > 0)){
                LCD_erase_rectangle(game_select);
                //change game selection
                current_game--;
                //change visual selection box
                game_select.y += LCD_CHAR_HEIGHT;
                LCD_draw_rectangle(game_select);
                timer_delay = 10;
            }
            //if joystick is moved down and the selection is not already at the bottom, move selection
            else if((bit_joy_y < JOY_LOW_THRESHOLD) && (current_game < 4)){
                LCD_erase_rectangle(game_select);
                //change game selection
                current_game++;
                //change visual selection box
                game_select.y -= LCD_CHAR_HEIGHT;
                LCD_draw_rectangle(game_select);
                timer_delay = 10;
            }
        }
    }
    LCD_erase_rectangle(game_select);
    game_menu.x -= LCD_CHAR_WIDTH;
    LCD_erase_rectangle(game_menu);
    button_flag = 0;

    LCD_erase_screen();

    timer_delay = 25;
}
/*runs given game*/
void run_game(GAME game){
    switch(game){
    case PONG:
        pong_mode = STANDARD_MODE;
        //have user select winning score for game
        pong_max_score();
        while(timer_delay);

        //have user select color of paddle
        pong_paddle_color();
        while(timer_delay);

        /*initialize and start the pong game*/
        initialize_pong();

        /*enter main pong game section*/
        pong_main();

        /*display winner and end pong*/
        end_pong();

        button_flag = 0;
        break;

    case DODGE:
        run_dodge();
        button_flag = 0;
        break;

    case DEBUG:
        full_debug();
        button_flag = 0;
        break;

    case PATTERN:
        run_pattern();
        button_flag = 0;
        break;

    case SNAKE:
        run_snake();
        button_flag = 0;
        break;
    }
}

/* Runs Snake Game */
void run_snake(void)
{
    // Objects
    RECT left_border, upper_border, right_border, lower_border;
    SNAKE_PLAYER player[SNAKE_PLAYER_MAX_SIZE];
    CIRCLE food;
    STATE food_state = DEAD, player_state = ALIVE;
    uint8_t player_size = SNAKE_PLAYER_START_SIZE, food_x, food_y;
    uint32_t snake_delay = SNAKE_TIMER_DELAY;
    DIRECTION dir = RIGHT;

    // Borders
    initialize_rectangle(&left_border, (LCD_MAX_X - SNAKE_BORDER_WIDTH), LCD_MIN_Y, SNAKE_BORDER_WIDTH, LCD_MAX_Y, RED);
    initialize_rectangle(&upper_border, LCD_MIN_X, (LCD_MAX_Y - SNAKE_BORDER_HEIGHT), LCD_MAX_X, SNAKE_BORDER_HEIGHT, RED);
    initialize_rectangle(&right_border, LCD_MIN_X, LCD_MIN_Y, SNAKE_BORDER_WIDTH, LCD_MAX_Y, RED);
    initialize_rectangle(&lower_border, LCD_MIN_X, LCD_MIN_Y, LCD_MAX_X, SNAKE_BORDER_HEIGHT, RED);

    LCD_draw_rectangle(left_border);
    LCD_draw_rectangle(upper_border);
    LCD_draw_rectangle(right_border);
    LCD_draw_rectangle(lower_border);

    // Spawn Player (Horizontal)
    for (uint8_t i = 0; i < SNAKE_PLAYER_START_SIZE; i++)
    {
        initialize_rectangle(&player[i].body, SNAKE_PLAYER_START_X + (5 * i), SNAKE_PLAYER_START_Y, SNAKE_PLAYER_WIDTH, SNAKE_PLAYER_HEIGHT, NAVY);
        LCD_draw_rectangle(player[i].body);
    }

    timer_count = 0;
    timer_delay = 20;
    while(timer_delay);

    //enter game loop
    while(player_state == ALIVE)
    {
        ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
        if (snake_delay <= 0)
        {
            //Place Food on the Ground if Food doesn't Exist
            if (food_state == DEAD)
            {
                food_state = ALIVE;

