Dishoungh/MSP432_Game_System/game.c
                if (player_size % 2)
                {
                    food_x = 20;
                }
                else
                {
                    food_x = 105;
                }

                if (!(player_size % 2))
                {
                    food_y = 20;
                }
                else
                {
                    food_y = 105;
                }
                initialize_circle(&food,food_x,food_y,SNAKE_FOOD_RADIUS,YELLOW,YELLOW);
                //initialize_circle(&food,(timer_count % (LCD_MAX_X - SNAKE_BORDER_WIDTH - 10)),(timer_count % (LCD_MAX_Y - SNAKE_BORDER_HEIGHT - 10)),SNAKE_FOOD_RADIUS,YELLOW,YELLOW);
                LCD_draw_circle(food);
            }

            // Move Snake
            for (uint8_t i = 0; i < player_size; i++)
            {
                player[i].prev_x = player[i].body.x;
                player[i].prev_y = player[i].body.y;
                // Move Head according to direction
                if (!i)
                {
                    //Player Head Movement
                    if((bit_joy_x > JOY_HIGH_THRESHOLD) && (dir != LEFT)) //Right
                    {
                        dir = RIGHT;
                    }
                    else if((bit_joy_x < JOY_LOW_THRESHOLD) && (dir != RIGHT)) //Left
                    {
                        dir = LEFT;
                    }
                    else if((bit_joy_y > JOY_HIGH_THRESHOLD) && (dir != DOWN)) //Up
                    {
                        dir = UP;
                    }
                    else if((bit_joy_y < JOY_LOW_THRESHOLD) && (dir != UP)) //Down
                    {
                        dir = DOWN;
                    }

                    switch(dir)
                    {
                        case RIGHT:
                            LCD_erase_rectangle(player[i].body);
                            (player[i].body).x -= 5;
                            LCD_draw_rectangle(player[i].body);
                            break;
                        case LEFT:
                            LCD_erase_rectangle(player[i].body);
                            (player[i].body).x += 5;
                            LCD_draw_rectangle(player[i].body);
                            break;
                        case UP:
                            LCD_erase_rectangle(player[i].body);
                            (player[i].body).y += 5;
                            LCD_draw_rectangle(player[i].body);
                            break;
                        case DOWN:
                            LCD_erase_rectangle(player[i].body);
                            (player[i].body).y -= 5;
                            LCD_draw_rectangle(player[i].body);
                            break;
                        default:
                            break;
                    }

                    // Border Collision Check
                    if (check_rect_collision(player[i].body, upper_border) || check_rect_collision(player[i].body, left_border) || check_rect_collision(player[i].body, right_border) || check_rect_collision(player[i].body, lower_border))
                    {
                        player_state = DEAD;
                        break;
                    }

                    //Snake Head Eat Food
                    if (check_rect_circ_collision(player[i].body, food))
                    {
                        food_state = DEAD;
                        LCD_erase_circle(food);

                        //Grow Snake from Tail
                        if (player_size < SNAKE_PLAYER_MAX_SIZE)
                        {
                            initialize_rectangle(&player[player_size].body, player[player_size-1].prev_x, player[player_size-1].prev_y, SNAKE_PLAYER_WIDTH, SNAKE_PLAYER_HEIGHT, NAVY);
                            LCD_draw_rectangle(player[player_size].body);
                            player_size++;
                        }
                    }
                }
                else
                {
                    //Follow
                    LCD_erase_rectangle(player[i].body);
                    (player[i].body).x = player[i-1].prev_x;
                    (player[i].body).y = player[i-1].prev_y;
                    LCD_draw_rectangle(player[i].body);

                    //Collision Between Head and Other Parts of the Tail (Except the Square Behind Head)
                    if (check_rect_collision(player[0].body, player[i].body) && (i-1))
                    {
                        player_state = DEAD;
                        break;
                    }
                }
            }


            snake_delay = SNAKE_TIMER_DELAY;
        }
        else
        {
            snake_delay--;
        }
    }

    //print ending screen
    LCD_erase_screen();
    uint8_t size_string[5] = "     ";
    itoa(player_size,size_string);

    //print ending screen
    LCD_write_string("GAME OVER",40,60,RED,9);
    LCD_write_string("SIZE:",55,40,BLACK,11);
    LCD_write_string(size_string,15,40,BLACK,sizeof(size_string)/sizeof(uint8_t));
    button_flag = 0;
    while(!button_flag);
}

/* Runs Pattern Game */
void run_pattern(void)
{
    RECT r1;
    initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
    LCD_draw_rectangle(r1);

    RECT r2;
    initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
    LCD_draw_rectangle(r2);

    RECT r3;
    initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
    LCD_draw_rectangle(r3);

    uint8_t* cpu_picks[3], player_picks[3];
    uint8_t i, score = 0;
    PATTERN_STATE state = SUCCESS;
    timer_count = 0;

    /* Game Loop */
    while (state == SUCCESS)
    {
        //Create Pattern and Show Pattern
        for (i = 0; i < 3; i++)
        {
            cpu_picks[i] = (uint8_t)(timer_count % 3);

            if (cpu_picks[i] == 0)                  //Picks first box
            {
                LCD_erase_rectangle(r1);
                initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, GREEN);
                LCD_draw_rectangle(r1);
            }
            else if(cpu_picks[i] == 1)              //Picks second box
            {
                LCD_erase_rectangle(r2);
                initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, GREEN);
                LCD_draw_rectangle(r2);
            }
            else                                //Picks third box
            {
                LCD_erase_rectangle(r3);
                initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, GREEN);
                LCD_draw_rectangle(r3);
            }

            //Delay for a little while
            for(uint32_t j = 0; j < PATTERN_SHOW_DELAY; j++);

