Dishoungh/MSP432_Game_System/game.c
            //Re-color Selected Rectangle Back to Black
            if (cpu_picks[i] == 0)                  //Picks first box
            {
                LCD_erase_rectangle(r1);
                initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                LCD_draw_rectangle(r1);
            }
            else if(cpu_picks[i] == 1)              //Picks second box
            {
                LCD_erase_rectangle(r2);
                initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                LCD_draw_rectangle(r2);
            }
            else                                //Picks third box
            {
                LCD_erase_rectangle(r3);
                initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                LCD_draw_rectangle(r3);
            }
        }

        uint8_t current_choice = 0;
        LCD_erase_rectangle(r1);
        initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, NAVY);
        LCD_draw_rectangle(r1);

        timer_delay = 0;
        button_flag = 0;

        //Pick Boxes to recreate pattern
        for (i = 0; i < 3; i++)
        {
            while(!button_flag)
            {
                ADC14->CTL0 |= ADC14_CTL0_SC;       //start ADC conversion
                if(timer_trigger && !timer_delay)
                {
                    // Move highlight by joystick
                    if((bit_joy_x > JOY_HIGH_THRESHOLD) && (current_choice < 2)) //Select Right
                    {
                        current_choice++;

                        if (current_choice == 1)
                        {
                            LCD_erase_rectangle(r1);
                            initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r1);

                            LCD_erase_rectangle(r2);
                            initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, NAVY);
                            LCD_draw_rectangle(r2);

                            LCD_erase_rectangle(r3);
                            initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r3);
                        }
                        else if (current_choice == 2)
                        {
                            LCD_erase_rectangle(r1);
                            initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r1);

                            LCD_erase_rectangle(r2);
                            initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r2);

                            LCD_erase_rectangle(r3);
                            initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, NAVY);
                            LCD_draw_rectangle(r3);
                        }
                        timer_delay = 10;
                    }
                    else if((bit_joy_x < JOY_LOW_THRESHOLD) && (current_choice > 0)) //Select Left
                    {
                        current_choice--;

                        if (current_choice == 0)
                        {
                            LCD_erase_rectangle(r1);
                            initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, NAVY);
                            LCD_draw_rectangle(r1);

                            LCD_erase_rectangle(r2);
                            initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r2);

                            LCD_erase_rectangle(r3);
                            initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r3);
                        }
                        else if (current_choice == 1)
                        {
                            LCD_erase_rectangle(r1);
                            initialize_rectangle(&r1, PATTERN_R1_START_X, PATTERN_R1_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r1);

                            LCD_erase_rectangle(r2);
                            initialize_rectangle(&r2, PATTERN_R2_START_X, PATTERN_R2_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, NAVY);
                            LCD_draw_rectangle(r2);

                            LCD_erase_rectangle(r3);
                            initialize_rectangle(&r3, PATTERN_R3_START_X, PATTERN_R3_START_Y, PATTERN_BOX_WIDTH, PATTERN_BOX_HEIGHT, BLACK);
                            LCD_draw_rectangle(r3);
                        }
                        timer_delay = 10;
                    }
                }
            }
            button_flag = 0;
            player_picks[i] = current_choice;
        }

        //Compare patterns
        for (i = 0; i < 3; i++)
        {
            if (cpu_picks[i] != player_picks[i])
            {
                state = FAIL;
                break;
            }
        }

        if (state != FAIL)
        {
            score++;
        }
    }

    //Print Score
    LCD_erase_screen();


    uint8_t score_string[5] = "     ";
    itoa(score,score_string);

    //print ending screen
    LCD_write_string("YOU LOST",40,60,RED,9);
    LCD_write_string("SCORE:",55,40,NAVY,11);
    LCD_write_string(score_string,15,40,NAVY,sizeof(score_string)/sizeof(uint8_t));

    button_flag = 0;

